music_app/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "session_token") VALUES ($1, $2, $3) RETURNING "id"  [["email", "dondon@don.don"], ["password_digest", "$2a$12$iLtx77KXLvlGd4Jbb6ySbOWzoibz2BlAqKH.abpEg5gYRGzXRGHOy"], ["session_token", "kCYdOA8U6_XlsfvHCt7Wrw"]]
---
    def create
        user = User.new(user_params)
        if user.save